const l="/zh-cn/assets/cover-f142cd17.jpg",e="/zh-cn/assets/image1-9d5b5029.jpg",s="/zh-cn/assets/image2-2129b7ac.jpg",t=[l,e,s],i={label:"计算机体系结构 l MIT课程学习新手上路宣讲",description:"MIT课程学习社区是一个兴趣导向的学习社区，大家或是想要补缺体系结构的基础知识，或是提升自己的实践和工程能力。MIT 6.175与MIT6.375的课程和Lab都有相当的难度，要求采用Bluespec语言实现RISC-V32位处理器，并支持多级流水、分支预测、异常处理、缓存一致性等功能。此外，Lab环节还涉及软硬件联合开发，要求基于所实现的RISC-V处理器运行真实的RISC-V程序，并给出性能评估。当真正着手开始学习MIT的这两门课程，会发现不要说坚持下来，能入门也不是一件容易的事情。为此，达坦科技软硬件联合开发工程师米明恒将在2023年9月23日（周六）上午10:30为大家带来一场计算机体系结构 l MIT课程学习新手上路宣讲。",cover:"./cover.jpg",location:"中国香港",date:"2023-09-19",title:"MIT Coursework Orientation for Newcomers"},o=[{label:"MIT 课程学习社区的源",level:2},{label:"MIT 课程学习新手上路宣讲",level:2},{label:"入门宣讲的目的",level:2},{label:"入门宣讲的要点",level:2},{label:"问卷调查",level:2}],p=`<p><img src="${l}" alt="封面"></p>
<h2 id="mit-课程学习社区的源">MIT 课程学习社区的源</h2>
<p>无论用哪一种语言，Bluespec、Chisel、SpinalHDL 来进行硬件设计，背后扎实的硬件设计基础知识都是必不可少的，特别是体系结构，因为体系结构的主要研究对象是指令集架构、处理器架构、存储器层次结构、总线和 IO 等，而 CPU 作为当今最复杂的数字芯片之一，非常适合作为学习实践相关知识的一只“麻雀”。</p>
<p>虽然国内大专院校计算机科学和电子工程专业都有开设体系结构或组成原理等相关课程，但是在实操环节缺失很多内容，特别是 CPU 缓存、内存管理、异常处理相关的部分，基本上都不涉及。当达坦科技做校招或招募在校实习生的时候，看到了潜在求职者在理论和实践之间的脱节。</p>
<p>为此，达坦科技在 2023 年始，发起成立<strong>计算机体系结构- MIT 课程学习社区</strong>，号召感兴趣的工程师和同学系统地学习计算机体系结构相关知识，并且通过动手项目来验证学习的成果。</p>
<h2 id="mit-课程学习新手上路宣讲">MIT 课程学习新手上路宣讲</h2>
<p>MIT 课程学习社区是一个兴趣导向的学习社区，大家或是想要补缺体系结构的基础知识，或是提升自己的实践和工程能力。MIT 6.175 与 MIT6.375 的课程和 Lab 都有相当的难度，要求采用 Bluespec 语言实现 RISC-V32 位处理器，并支持多级流水、分支预测、异常处理、缓存一致性等功能。此外，Lab 环节还涉及软硬件联合开发，要求基于所实现的 RISC-V 处理器运行真实的 RISC-V 程序，并给出性能评估。当真正着手开始学习 MIT 的这两门课程，会发现不要说坚持下来，能入门也不是一件容易的事情。为此，<strong>达坦科技软硬件联合开发工程师米明恒</strong>将在 <strong>2023 年 9 月 23 日（周六）上午 10:30</strong> 为大家带来一场计算机体系结构 l MIT 课程学习新手上路宣讲。</p>
<h2 id="入门宣讲的目的">入门宣讲的目的</h2>
<ol>
<li>帮助新手上路，降低学习初期阶段的难度（降低初期淘汰率，核心目标）。</li>
<li>系统地介绍一下 MIT 培训的体系，让大家对自己的学习有一个整体的规划。</li>
<li>现场答疑。</li>
</ol>
<h2 id="入门宣讲的要点">入门宣讲的要点</h2>
<ol>
<li>MIT 几门课程的内容概要，各个章节的学习顺序，学习重点。</li>
<li>公开课课程网站上各种资料的位置及其作用。</li>
<li>如何在 Github 上搜集代码并搭建自己的实验环境。</li>
</ol>
<h2 id="问卷调查">问卷调查</h2>
<p>请各位已经或即将参加体系结构 MIT 课程培训的社区成员，或有意参加入门宣讲的观众，<strong>在参会前提前完成以下调查问卷。</strong>（<strong>扫描下方二维码</strong>或点击<strong>阅读原文</strong>进行填写）</p>
<p><img src="${e}" alt="图片"></p>
<p>欢迎您预约直播，或者登陆腾讯会议观看直播：<br>
会议号：474-6575-9473</p>
<p><img src="${s}" alt="图片"></p>`;export{t as assetURLs,p as default,i as metadata,o as toc};
