const e="/zh-cn/assets/cover-2326b9d3.jpg",t="/zh-cn/assets/image1-62ba36d5.png",i="/zh-cn/assets/image2-238eb6f5.jpg",s="/zh-cn/assets/image3-9644e0b1.png",l=[e,t,i,s],a={label:"MIT体系结构公开课学习社区2.0版正式上线啦～",description:"随着芯片技术自主可控成为国家重要的战略发展规划，对芯片设计相关领域的人才需求也在快速增长。体系结构课程相对于硬件设计的重要性可以类比于设计模式相对于软件设计的重要性，扎实的体系结构基础是设计复杂硬件的基石。然而现实情况是，虽然国内大专院校计算机学科、电子工程学科、微电子等都有开设体系结构或组成原理等相关课程，但由于前些年对相关教学重视度不够，导致教学实践环节存在诸多缺失，毕业生掌握的技能与工业界的期望之间存在较大差距。由此，在2023年伊始，达坦科技发起成立了MIT体系结构公开课学习社区，邀请所有对硬件敏捷开发设计感兴趣的同学加入我们，组成拥有共同学习目标的互助自学小组，一起系统地学习计算机体系结构相关知识，并且通过动手项目来验证学习的成果。",cover:"./cover.jpg",location:"中国香港",date:"2023-12-14",title:"MIT Architecture Open Course Learning Community Version 2.0 is officially launched~"},c=[{label:"为什么要发起设立 MIT 体系结构公开课学习社区？",level:2},{label:"学习社区运营十个月有什么成果？",level:2},{label:"为什么要升级 MIT 体系结构公开课学习社区 2.0 版？",level:2},{label:"MIT 体系结构公开课学习社区 2.0 版有什么改进？",level:2},{label:"欢迎报名",level:2}],n=`<p><img src="${e}" alt="封面"></p>
<h2 id="为什么要发起设立-mit-体系结构公开课学习社区？">为什么要发起设立 MIT 体系结构公开课学习社区？</h2>
<p>随着芯片技术自主可控成为国家重要的战略发展规划，对芯片设计相关领域的人才需求也在快速增长。<strong>体系结构课程</strong>相对于硬件设计的重要性可以类比于设计模式相对于软件设计的重要性，扎实的体系结构基础是设计复杂硬件的基石。然而现实情况是，虽然国内大专院校计算机学科、电子工程学科、微电子等都有开设体系结构或组成原理等相关课程，但由于前些年对相关教学重视度不够，导致教学实践环节存在诸多缺失，毕业生掌握的技能与工业界的期望之间存在较大差距。</p>
<p>由此，在 2023 年伊始，<strong>达坦科技发起成立了 MIT 体系结构公开课学习社区</strong>，邀请所有对<strong>硬件敏捷开发设计</strong>感兴趣的同学加入我们，组成拥有共同学习目标的互助自学小组，一起系统地学习计算机体系结构相关知识，并且通过动手项目来验证学习的成果。</p>
<h2 id="学习社区运营十个月有什么成果？">学习社区运营十个月有什么成果？</h2>
<p>学习社区到今天也运营了十余个月，社区的成员基本都是国内外 Top 院校计算机或电子工程专业大三以上的学生，也有小部分已经毕业工作的工程师为了提升自己这块知识加入我们的社区。简而言之，这是一个<strong>兴趣导向的、公益性质的自学互助学习社区</strong>。但达坦科技还是给社区配备了<strong>专门的 TA 答疑</strong>，同时，给新加入的新手持续<strong>提供各种贴士和补给</strong>，包括：</p>
<p>[MIT 课程新手上路指导]<br>
<a href="https://mp.weixin.qq.com/s/gB7_y4CFFf7QIBUceNbsoA">计算机体系结构 l MIT 课程学习新手上路宣讲视频</a></p>
<p>[MIT 课程学习经验分享]<br>
<a href="https://mp.weixin.qq.com/s/gB7_y4CFFf7QIBUceNbsoA">计算机体系结构 MIT 课程学习社区经验分享视频</a></p>
<p>[MIT 课程 Q&#x26;A]
<a href="http://mp.weixin.qq.com/s?__biz=MzkwNTMzOTE2MA==&#x26;mid=2247485751&#x26;idx=3&#x26;sn=36a5323b3c32984bb94c97b313aa0c23&#x26;chksm=c0f80140f78f8856abd37f667cbd06a3267eed4ed34c1d36f16f527d8613ea14d1dbdcad0b8f&#x26;scene=21#wechat_redirect">计算机体系结构 l MIT Training Q&#x26;A 及小贴士</a></p>
<p>[MIT 课程学习笔记]
<a href="http://mp.weixin.qq.com/s?__biz=MzkwNTMzOTE2MA==&#x26;mid=2247485625&#x26;idx=1&#x26;sn=26167c93b21a5eccca61e89cf91055ca&#x26;chksm=c0f800cef78f89d8640873aede5db6711770234b73609450f9ada007f6b71dd747277649fdf1&#x26;scene=21#wechat_redirect">计算机体系结构｜ MIT6.175 和 MIT6.375 学习笔记</a></p>
<p>十个月以来，共有 10+位同学完成了所有三个阶段的课程学习。我们向他们的坚持和取得的成果表示祝贺！</p>
<h2 id="为什么要升级-mit-体系结构公开课学习社区-2.0-版？">为什么要升级 MIT 体系结构公开课学习社区 2.0 版？</h2>
<p>从 10 个月完成三阶段课程的同学数量不难看出，这并不是一系列容易“啃下来”的课程。三门公开课的难度级别分别对应于本科必修课（6.004）、硕士必修课（6.175）以及实践选修课（6.375），内容涵盖了组合逻辑、简单时序逻辑、流水线及流式数据处理、RISC-V 指令集架构、RISC-V 处理器实现、Cache、中断异常、Non-Blocking Cache、多核处理器、Cache Coherence 等。</p>
<p>所以，如何能形成更好的学习社区氛围，如何设计更好的激励制度来鼓励和助力同学们设定目标并严格执行，进而每日积跬步，顺利完成学习各阶段学习任务一直是我们在思考的问题，现在准备工作做好了，因此，我们正式推出 <strong>MIT 体系结构公开课学习社区 2.0 版</strong>。</p>
<h2 id="mit-体系结构公开课学习社区-2.0-版有什么改进？">MIT 体系结构公开课学习社区 2.0 版有什么改进？</h2>
<ul>
<li>课程内容重新规划，现分为三个阶段：</li>
</ul>
<p><img src="${t}" alt="封面"></p>
<ul>
<li>提交报名表，报名通过后，给予学号，以便后续追踪同学的学习进展。</li>
<li>引入打卡制度：
<ul>
<li>记录每日的学习时长；</li>
<li>记录学习的进度和遇到的问题；</li>
<li>学习成果开源提交；</li>
<li>每个月打卡少于 4 次，即自动退出学习社区；</li>
</ul>
</li>
<li>新增荣誉榜：
<ul>
<li>每周表彰学习时长 Top3，以及在学习社区积极分享经验、教训、答疑的同学；</li>
<li>完成每一个阶段学习的同学，在达坦科技官网的 MIT 体系结构公开课荣誉榜页面上授予徽章；</li>
<li>完成三个阶段学习的同学，授予认证证书及礼品书籍一份；</li>
<li>完成三个阶段学习的同学，自动获得达坦科技实习面试的机会。</li>
</ul>
</li>
</ul>
<p>所有的设计和升级皆是因为 MIT 体系结构公开课是不容易的课程，知难而退或者索性躺平都是很正常的反应，我们希望可以通过一些变化鼓励你，按照自己的节奏、按照自己的步幅走，但是，必须“走”，持续地“小步走”，以接近你加入学习社区设定的目标！</p>
<h2 id="欢迎报名">欢迎报名</h2>
<p><strong>请扫描二维码，</strong> 填写报名表，加入 MIT 体系结构公开课学习社区项目。</p>
<p><strong>报名成功后，将收到邮件确认及学号。</strong></p>
<p><img src="${i}" alt="图片"></p>
<p>关于 MIT 体系结构公开课学习社区项目有任何问题或疑问，可以邮件：<strong><a href="mailto:ta@datenlord.com">ta@datenlord.com</a></strong>或添加<strong>DatenLord 小助手</strong>微信咨询。</p>
<p><img src="${s}" alt="图片"></p>`;export{l as assetURLs,n as default,a as metadata,c as toc};
