const r="/zh-cn/assets/cover-a0876a4f.png",t="/zh-cn/assets/image1-3f332210.png",o="/zh-cn/assets/image2-6cee146a.png",e="/zh-cn/assets/image1-bf4f8777.png",n="/zh-cn/assets/image-d0c27c17.png",a=[r,t,o,e,n],s={label:"喜报！DatenLord荣获2025 AI网络技术“智网技术先锋奖”",description:"在数字经济与人工智能深度融合的时代，“AI for Network”与“Network for AI”双轮驱动正重塑网络技术格局。8月9日，以“智联万物 网聚未来”为主题的2025 AI网络技术应用创新大会在北京隆重召开。DatenLord的开源RDMA网卡软硬件系统项目和高性能AI推理框架凭借在AI网络领域的创新突破，荣获大会颁发的“智网技术先锋奖”，再次彰显技术实力与行业影响力！",cover:"./cover.png",location:"中国香港",date:"2025-08-21",title:"DatenLord Wins 2025 AI Networking Pioneer Award"},p=[{label:"引言",level:2},{label:"聚焦前沿：2025 AI网络技术应用创新大会",level:2},{label:"技术突破：DatenLord斩获“智网技术先锋奖”",level:2},{label:"Open-RDMA：DatenLord的开源RDMA网卡软硬件方案",level:3},{label:"深度优化的推理引擎",level:3},{label:"未来展望",level:2}],l=`<h2 id="引言">引言</h2>
<p>在数字经济与人工智能深度融合的时代，“AI for Network”与“Network for AI”双轮驱动正重塑网络技术格局。8月9日，以“智联万物 网聚未来”为主题的2025 AI网络技术应用创新大会在北京隆重召开。DatenLord的开源RDMA网卡软硬件系统项目和高性能AI推理框架凭借在AI网络领域的创新突破，荣获大会颁发的“智网技术先锋奖”，再次彰显技术实力与行业影响力！
<img src="${t}" alt="图片"></p>
<p>作为中国RISC-V领域最具影响力的行业峰会，RISC-V中国峰会已连续五年推动开源芯片生态的繁荣发展。2025年，峰会规模进一步升级，预计将多场技术分论坛及同期活动，其中，作为本届RISC-V中国峰会的同期活动的主办方，达坦科技将于7月19日下午一点至四点，举办第四届“敏捷硬件开发与验证方法学”研讨会。</p>
<h2 id="聚焦前沿：2025-ai网络技术应用创新大会">聚焦前沿：2025 AI网络技术应用创新大会</h2>
<p>本次大会由中国通信学会信息通信网络技术专业委员会、开源技术专业委员会指导，江苏省未来网络创新研究院主办，汇聚了来自产学研用各领域的顶尖专家与企业代表，共同探讨AI与网络技术的融合创新。</p>
<p>大会亮点：</p>
<ul>
<li>权威引领：院士、学者与产业领袖分享AI网络架构、算力网络、智能运维等前沿趋势。</li>
<li>生态共建：开源社区、运营商、科技企业共话技术落地，推动行业升级。</li>
<li>创新表彰：设立“智驱应用标杆奖”和“智网技术先锋奖”，评选具有突破性贡献的技术方案与企业。</li>
</ul>
<h2 id="技术突破：datenlord斩获“智网技术先锋奖”">技术突破：DatenLord斩获“智网技术先锋奖”</h2>
<p>AI网络技术年度评选是由2025 AI网络技术应用创新大会组委会组织发起。作为本年度人工智能与网络技术交叉领域权威性行业评选活动，本届评选以技术先进性、场景适配度、生态贡献力等为评价标准，旨在发掘、评选行业内AI网络关键性技术及应用取得显著成果的标杆单位。</p>
<p>智网技术先锋奖面向在AI算力调度、分布式训练网络架构设计、超低时延数据传输等算网融合领域的技术创新解决方案，要求方案具备跨域协同能力与规模化部署潜力，推动算力网络基础设施智能化升级。</p>
<p>达坦科技是一家专注于AI大模型基础设施的高科技企业，核心业务聚焦于高性能RDMA网络与AI推理平台的研发与落地。公司从云计算转型至AI大模型领域，致力于通过软硬件融合的方式，为大规模模型推理提供弹性、稳定、经济的底层基础设施服务。主要产品包括自研的400G高性能RDMA网卡、高性能集合通信库以及跨平台的AI推理框架，广泛适配国产及国际主流GPU平台。此次获奖，是对团队技术原创性与应用价值的充分肯定！
<img src="${o}" alt="图片"></p>
<h3 id="open-rdma：datenlord的开源rdma网卡软硬件方案">Open-RDMA：DatenLord的开源RDMA网卡软硬件方案</h3>
<p>随着大模型相关技术的迅猛发展，对于底层网络通信的细粒度控制已经成为大模型性能优化必不可少的一环。为打破目前RDMA网卡大多为黑盒难以进行细粒度优化控制的问题，DatenLord即将推出基于FPGA的100G、200G、400G RDMA网卡，其中，各型号网卡驱动程序100%开源，100G网卡硬件RTL设计开源，400G网卡正在与部分单位进行内部测试。</p>
<p>基于Open-RDMA项目，客户可实现对网卡内各级流水线的定制，100%细粒度控制缓存策略、重传策略、拥塞控制策略，从而针对不同的业务场景、网络规模、流量特征进行优化，实现吞吐率最大化以及延迟最小化。同时客户还可以将部分业务逻辑offload到FPGA的剩余逻辑资源上，实现真正意义上的软硬件协同优化。</p>
<h3 id="深度优化的推理引擎">深度优化的推理引擎</h3>
<p>DatenLord推出的AI推理框架支持软硬件融合的推理引擎调优，针对不同型号GPU与异构加速卡进行定制化优化，提升算力利用率和执行效率。同时，它还能与高研通信框架深度融合，最大限度利用网络带宽。对于算力受限场景，框架可将模型切分成多个子模块分布在不同GPU上并行执行，采用流水线与张量并行策略提升效率。在异构算力的PD分离方面，支持不同品牌芯片混合部署，按任务类型匹配算力强弱，实现带宽利用率提升和延迟降低。在易用性方面，可视化界面实时查看任务性能与资源占用，支持弹性扩展、动态参数调优与多模型一键部署，满足多变业务需求。</p>
<h2 id="未来展望">未来展望</h2>
<p>DatenLord 的软硬件融合方案针对国产算力利用率低、兼容性差和性能瓶颈等问题，提出一体化深度集成与优化思路，将核心算子封装进主流推理框架并进行指令级优化，配合RDMA网卡驱动提升IO吞吐，实现高效互联。方案具备算法直接兼容、推理速度媲美中端N卡、即插即用等优势，支持边缘部署、AI云及行业定制化场景，帮助客户最大化再利用现有GPU卡，降低成本，形成“算力=硬件+框架+算法”的国产替代闭环。</p>
<p>我们将秉持“软硬件融合 + 开源开放”的理念，致力于打造具备灵活部署能力和高性能表现的AI基础设施，持续深耕AI与网络技术的交叉创新，推动智能算力资源的高效互联，为全球客户提供更优质的基础设施服务！</p>
<p><img src="${e}" alt="图片">
<strong>达坦科技</strong>始终致力于打造高性能 <strong>Al+ Cloud 基础设施平台</strong>，积极推动 AI 应用的落地。达坦科技通过<strong>软硬件深度融合</strong>的方式，提供高性能存储和高性能网络。为 AI 应用提供<strong>弹性、便利、经济</strong>的基础设施服务，以此满足不同行业客户对 AI+Cloud 的需求。</p>
<p><strong>公众号：</strong> 达坦科技DatenLord</p>
<p><strong>DatenLord官网：</strong> <a href="https://datenlord.github.io/zh-cn/">https://datenlord.github.io/zh-cn/</a></p>
<p><strong>知乎账号：</strong> <a href="https://www.zhihu.com/org/da-tan-ke-ji">https://www.zhihu.com/org/da-tan-ke-ji</a></p>
<p><strong>B站：</strong> <a href="https://space.bilibili.com/2017027518">https://space.bilibili.com/2017027518</a></p>
<p><strong>邮箱：</strong> <a href="mailto:info@datenlord.com">info@datenlord.com</a></p>
<p>如果您有兴趣加入<strong>达坦科技Rust前沿技术交流群或硬件相关的群</strong>  ，请添加<strong>小助手微信</strong>：DatenLord_Tech
<img src="${n}" alt="图片"></p>`;export{a as assetURLs,l as default,s as metadata,p as toc};
